{
    "La Hầu": "Là vì sao chánh thất kiến hung tai, cho nên năm nào người có bị sao La Hầu, xem như năm đó bị xấu, nhưng Nam giới kỵ nhiều hơn Nữ giới, nên đề phòng tháng Giêng và tháng 7. Người Nam giới có thể bị tranh chấp rồi đưa đến đến cò bót nếu nặng, làm đau buồn trong gia-đình. Riêng Nữ giới lo âu, buồn phiền hay bịnh hoạn hoặc sanh dưỡng khó khăn. Người ta chỉ bảo, nếu người bị sao La-Hầu, mỗi tháng vào ngày mùng 8 âm-lịch dùng 9 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang, quay hướng chánh Bắc để khấn vái : “Thiên Cung Thần Thủ La Hầu Tinh Quân”, thì sẽ được nhẹ bớt phần nào.",
    "Thổ Tú": "Người bị sao này thường kỵ tháng 4 và tháng 8, nên đề phòng kẻ tiểu nhơn, gia-đạo đưa đến bất an và buồn phiền. Người ta chỉ bảo, nếu người bị sao Thổ Tú, mỗi tháng vào ngày 19 âm-lịch dùng 5 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang khấn vái về hướng chánh Tây mà khấn vái : “Trung Ương Mậu Kỷ Thổ Đức Tinh Quân”, thì sẽ được nhẹ bớt phần nào.",
    "Thủy Diệu": "Người bị sao này thường kỵ tháng 4 và tháng 8, giống như Sao Thổ Tú, cho nên có sách viết : “Thổ Tú, Thủy Diệu tứ bát ai”. Nhưng xét cho kỷ, người bị sao Thủy Diệu có kiết, có hung. Nếu người Nam giới đi làm ăn sẽ khá và có lợi hơn Nữ giới.Người ta chỉ bảo, nếu người bị sao Thổ Tú, mỗi tháng vào ngày 21 âm-lịch dùng 7 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang khấn vái quay mặt về hướng chánh Bắc mà khấn vái : “Bắc Phương Nhâm Quý Thủy Đức Tinh Quân”, thì sẽ được nhẹ bớt phần nào.",
    "Thái Bạch": "Người bị sao Thái Bạch thường kỵ tháng 5, tuy nhiên có kiết, có hung. Người Nam giới, năm nay gia-đạo thăng trầm nên lo âu, nhưng có quới nhân giúp đỡ. Riêng người Nữ giới thường bị đau ốm, nên ngừa tiểu nhân và đưa đến sự tranh chấp. Người ta chỉ bảo, nếu người bị sao Thái Bạch, mỗi tháng vào ngày rằm (15) âm-lịch dùng 8 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang quay mặt về hướng chánh Tây mà khấn vái : “Tây Phương Canh Tân Kim Đức Tinh Quân”, thì sẽ được nhẹ bớt phần nào.",
    "Thái Dương": "Người Nam giới có được sao Thái Dương xem như năm làm ăn tấn tới, đi xa có tài lộc, an khang phát đạt vào tháng 6 và tháng 10. Người Nữ giới thì trái lại, cho nên người ta chỉ bảo, mỗi tháng vào ngày 27 âm-lịch dùng 12 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang quay mặt về hướng Đông mà khấn vái : “Nhật Cung Thái Dương Thiên Tử Tinh Quân”, thì sẽ được nhẹ bớt phần nào.",
    "Vân Hớn": "Là vì sao hung tinh bị nhị bát khẩu thiệt tức tháng 2 và tháng 8 rất kỵ. Do vậy, người bị sao này nên thận trọng lời nói, để tránh sự tranh chấp bất lợi đưa đến kiện tụng cò bót. Người ta chỉ bảo, nếu người bị sao Vân Hớn, mỗi tháng vào ngày 29 âm-lịch dùng 15 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang, quay mặt về hướng chánh Nam mà khấn vái : “Nam Phương Bính Đinh Hỏa Đức Tinh Quân”, thì sẽ được nhẹ bớt phần nào.",
    "Kế Đô": "Là vì sao tam cửu khóc bi ai, cho nên năm nào người có bị sao Kế Đô, xem như năm đó bị xấu, nhưng Nữ giới kỵ nhiều hơn Nam giới, nên đề phòng tháng 3 và tháng 9. Bởi vì, người ta thường nói : “Nam La Hầu, Nữ Kế Đô” để chỉ cái khắc kỵ của các sao đối với phái nam hay phái nữ năm đó. Người Nam giới sanh hoạt bình thường, nếu có việc gì xảy đến cũng tiền hung hậu kiết. Trái lại, người Nữ giới có thể bị tranh chấp đưa đến cò bót hoặc nếu nặng hơn đưa đến bi ai trong gia đạo. Người ta chỉ bảo, nếu người bị sao Kế Đô, mỗi tháng vào ngày 18 âm-lịch dùng 21 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang quay mặt về hướng chánh Tây mà khấn vái :”Thiên Cung Phân Vỹ Kế Đô Tinh Quân” , thì sẽ được nhẹ bớt phần nào.",
    "Thái Âm": "Người có sao này được kiết tinh, làm ăn phát đạt, mọi chuyện hạnh thông vào tháng 9. Tuy nhiên tháng 11 âl kỵ sanh đẻ cho Nữ giới hay bịnh hoạn Nam giới. Bởi vì, sao này cửu kiết thập nhứt ác. Người ta chỉ bảo, nếu người bị sao Kế Đô, mỗI tháng vào ngày 26 âm-lịch dùng 7 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang, quay mặt về hướng chánh Tây mà khấn vái : “Nguyệt Cung Thái Âm Hoàng Hậu Tinh Quân”, thì sẽ được nhẹ bớt phần nào.",
    "Mộc Đức": "Người có sao này cũng được kiết tinh như sao Thái Âm, làm ăn phát đạt, có tài lộc cho nên việc dựng vợ gã chồng cho các con cũng tốt, mọi chuyện hạnh thông. Đặc-biệt, vào tháng Chạp thì rất tốt. Bởi vì, sao “Mộc Đức thập nhị trùng lai”. Tuy nhiên, người Nam giới hay đau mắt và người Nữ giới cũng hay đau máu huyết. Người ta chỉ bảo, nếu người bị sao Mộc Đức, mỗi tháng vào ngày 25 âm-lịch dùng 20 đèn cầy (nến), hoa quả, trà nước, bánh trái và đốt 3 cây nhang, quay mặt về hướng Đông mà khấn vái : “Đông Phương Giáp Ất Mộc Đức Tinh Quân”, thì sẽ được nhẹ bớt phần nào. Chúng ta đã thấy Ý Nghĩa và Phương Cách Cúng Sao hằng năm, để mọi người xem coi rớt vào sao kiết hay sao hung, cho nên năm nào sao tốt thì an tâm, còn năm nào sao xấu thì lo lắng để cúng sao.Nhưng thiết nghĩ, người biết thương người như thể thương thân, thì dù có bị sao hung đi nữa cũng bình an tự tại, sẽ có đời sống bình-an và hạnh phúc, còn trái lại người không biết thương người như thể thương thân, thì dù có được sao kiết chăng nữa cũng không an cư lạc nghiệp, bởi vì sự tranh chấp ham danh đoạt lợi thì sẽ đưa đến đời sống bất an như thường."

}